{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "input_dim": 23678, "trainable": false, "mask_zero": false, "input_length": 80, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "output_dim": 300, "batch_input_shape": [null, 80], "name": "embedding_14", "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "trainable": true, "units": 300, "name": "lstm_14", "implementation": 1, "return_sequences": false, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "use_bias": true, "bias_constraint": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 100, "name": "dense_27", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1, "name": "dense_28", "bias_constraint": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential"}