{"config": [{"config": {"output_dim": 300, "mask_zero": false, "dtype": "float32", "batch_input_shape": [null, 80], "trainable": false, "input_dim": 35736, "embeddings_regularizer": null, "input_length": 80, "embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_7", "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"activation": "tanh", "kernel_constraint": null, "return_state": false, "recurrent_regularizer": null, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "units": 300, "use_bias": true, "return_sequences": false, "unit_forget_bias": true, "dropout": 0.0, "stateful": false, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_regularizer": null, "name": "lstm_7", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_13", "activity_regularizer": null, "units": 100}, "class_name": "Dense"}, {"config": {"use_bias": true, "activation": "sigmoid", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_14", "activity_regularizer": null, "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}