{"keras_version": "2.2.0", "config": [{"config": {"input_length": 80, "embeddings_constraint": null, "batch_input_shape": [null, 80], "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "activity_regularizer": null, "mask_zero": false, "name": "embedding_11", "input_dim": 15690}, "class_name": "Embedding"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1, "bias_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": false, "recurrent_constraint": null, "units": 300, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_11", "kernel_constraint": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "units": 100, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_21", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "units": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_22", "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}