{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_13", "batch_input_shape": [null, 80], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "dtype": "float32", "embeddings_regularizer": null, "input_length": 80, "trainable": false, "mask_zero": false, "input_dim": 34259, "embeddings_constraint": null, "output_dim": 300, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_13", "activation": "tanh", "use_bias": true, "go_backwards": false, "unit_forget_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_regularizer": null, "units": 300, "kernel_constraint": null, "bias_regularizer": null, "implementation": 1, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "stateful": false}}, {"class_name": "Dense", "config": {"name": "dense_25", "activation": "relu", "use_bias": true, "units": 100, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_26", "activation": "sigmoid", "use_bias": true, "units": 1, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}], "keras_version": "2.2.0", "backend": "tensorflow"}