{"keras_version": "2.2.0", "config": [{"class_name": "Embedding", "config": {"dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null, "activity_regularizer": null, "trainable": false, "batch_input_shape": [null, 80], "mask_zero": false, "input_dim": 18944, "embeddings_regularizer": null, "input_length": 80, "output_dim": 300, "name": "embedding_5"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "units": 300, "use_bias": true, "go_backwards": false, "dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "trainable": true, "name": "lstm_5", "recurrent_dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "unroll": false, "kernel_regularizer": null, "return_sequences": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "activity_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "units": 100, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "sigmoid", "units": 1, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}], "class_name": "Sequential", "backend": "tensorflow"}