{"config": [{"config": {"input_length": 80, "trainable": false, "name": "embedding_10", "dtype": "float32", "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 24759, "mask_zero": false, "batch_input_shape": [null, 80], "embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "output_dim": 300}, "class_name": "Embedding"}, {"config": {"unit_forget_bias": true, "bias_regularizer": null, "activity_regularizer": null, "return_state": false, "dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_10", "units": 300, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "return_sequences": false, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dense_19", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 75, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_20", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid"}, "class_name": "Dense"}], "keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential"}