{"backend": "tensorflow", "config": [{"config": {"name": "embedding_11", "trainable": false, "dtype": "float32", "batch_input_shape": [null, 80], "embeddings_regularizer": null, "activity_regularizer": null, "mask_zero": false, "input_length": 80, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "input_dim": 35736, "output_dim": 300}, "class_name": "Embedding"}, {"config": {"name": "lstm_11", "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "trainable": true, "kernel_regularizer": null, "return_sequences": false, "stateful": false, "implementation": 1, "recurrent_regularizer": null, "unit_forget_bias": true, "return_state": false, "recurrent_activation": "hard_sigmoid", "units": 300, "dropout": 0.0, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_21", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "units": 75, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_22", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "units": 1, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential"}