{"class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Embedding", "config": {"name": "embedding_11", "embeddings_regularizer": null, "mask_zero": false, "dtype": "float32", "batch_input_shape": [null, 80], "embeddings_constraint": null, "output_dim": 300, "activity_regularizer": null, "input_length": 80, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "trainable": false, "input_dim": 40204}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "name": "lstm_11", "dropout": 0.0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "implementation": 1, "kernel_constraint": null, "go_backwards": false, "units": 300, "trainable": true, "return_sequences": false, "activation": "tanh", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "stateful": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "units": 100, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "name": "dense_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "units": 1, "bias_regularizer": null}}], "backend": "tensorflow"}